// // 模拟的数据

// // 轮播图
// List mockBannerList = [
//   {
//     "type_link": 1,
//     "thumb_url":
//         "https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=3780860133,2882073126&fm=26&gp=0.jpg",
//   },
//   {
//     "type_link": 2,
//     "thumb_url":
//         "https://ss3.bdstatic.com/70cFv8Sh_Q1YnxGkpoWK1HF6hhy/it/u=70307828,2500720093&fm=26&gp=0.jpg",
//   },
//   {
//     "type_link": 3,
//     "thumb_url":
//         "https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=2902605362,3026849888&fm=26&gp=0.jpg",
//   },
//   {
//     "type_link": 4,
//     "thumb_url":
//         "https://ss1.bdstatic.com/70cFvXSh_Q1YnxGkpoWK1HF6hhy/it/u=776499928,2993208597&fm=26&gp=0.jpg",
//   },
//   {
//     "type_link": 5,
//     "thumb_url":
//         "https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=2547569747,1798078359&fm=11&gp=0.jpg",
//     "news_type": 1,
//   },
// ];

// /*
//   考试题目数据
//     1单选 3判断 2多选 4填空
// */
// List listData = [
//   {
//     "id": 123,
//     "type": 3,
//     "stem": "采掘工作面的空气温度超30℃，机电设备硐室的空气温度超过34℃时，必须停止作业。（对）",
//     "option": [
//       {"label": "A", "value": "对"},
//       {"label": "B", "value": "错"}
//     ],
//     "answer": ["A"], //正确答案
//     "analysis": "绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的", //答案解析
//     "disorder": 1, //当前题目分数
//     "userFavor": false, //用户是否收藏
//   },
//   {
//     "id": 465,
//     "type": 2,
//     "stem": "采掘工作面的空气温度超30℃，机电设备硐室的空气温度超过34℃时，必须停止作业。（对）",
//     "option": [
//       {"label": "A", "value": "大家发的"},
//       {"label": "B", "value": "废话不说的"},
//       {"label": "C", "value": "v让法国人"},
//       {"label": "D", "value": "的发电厂"},
//       {"label": "E", "value": "发的发的"},
//       {"label": "F", "value": "人头就喝点水"},
//       {"label": "G", "value": "发给你不发给"},
//       {"label": "H", "value": "违法污染"},
//       {"label": "I", "value": "你干嘛"},
//     ],
//     "answer": ["C", "F", "H"], //正确答案
//     "analysis": "绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的", //答案解析
//     "disorder": 3, //当前题目分数
//     "userFavor": false, //用户是否收藏
//   },
//   {
//     "id": 798,
//     "type": 2,
//     "stem": "谁离开的风景粮食局公司就两三点尽量少就过来说了疯狂过",
//     "option": [
//       {"label": "A", "value": "创建"},
//       {"label": "B", "value": "额外"},
//       {"label": "C", "value": "的疯狂了"},
//       {"label": "D", "value": "破副本"},
//       {"label": "E", "value": "丹佛排水沟IE"},
//     ],
//     "answer": ["A", "C"], //正确答案
//     "analysis": "绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的绿色的风景水果机的", //答案解析
//     "disorder": 5, //当前题目分数
//     "userFavor": true, //用户是否收藏
//   },
// ];

// /*
//   新闻列表项、新闻详情
// */
// List newsDataList = [
//   {
//     "id": 188, //新闻id
//     "pid": 2, //导航id
//     "title": "矿安全改建及二水平延深工程顺利通过竣工验收", //标题
//     "desc": "矿安全改建及二水平延深工程顺利通过竣工验收", //简介
//     "thumb_url":
//         "http://pansan_api.fangda.net.cn/uploads/image/20201211/1607690197838.", //封面
//     "type": 1, //新闻类型 1图文  2视频
//     "materia_id": 123, //资源id
//     "content":
//         '<p><img src="http://pansan_api.fangda.net.cn/uploads/image/20201211/20201211183707_36279.jpg"></p><p>（本网讯）12月11日，集团公司验收委员会对我矿安全改建及二水平延深工程进行竣工验收。在听取有关汇报、分组查看现场及查阅相关资料后，验收委员会一致同意通过我矿安全改建及二水平延深工程竣工验收。集团公司党委副书记、总经理王世森出席竣工验收会议并讲话。</p><p><br></p><p>集团公司副总经理韩家章主持竣工验收会议。煤业公司党委副书记、总经理胡少银，矿长陈士虎、矿党委书记王晓峰在三楼东会议室迎接验收委员会一行。</p><p><br></p><p>王世森首先对验收委员会各专家的到来表示欢迎，并对各专家的辛勤劳动表示感谢。他指出，当前集团公司正沿着煤、电、气三大能源主业的产业链、服务链、价值链，深化改革创新，加快转型升级，奋力打造现代大型综合能源服务集团。企业目前正加快推进组织管控模式调整和人力资源薪酬改革等重点工作，生产经营形势平稳有序。</p><p><br></p><p>王世森表示，在经过上一轮去产能后，煤炭企业将在更高层面上展开竞争，因此科学编制生产接替规划十分重要。近几年，本土煤业重点在进一步做强做精上下功夫，认真谋划存续矿井的未来发展，潘三矿安全改建及二水平延深工程项目是集团公司综合考量的重点项目，项目建设对本土煤矿解决提升能力不足和采场接替等问题意义重大，将为矿井安全高效可持续开采蓄能。他要求，此次通过竣工验收后，相关部门和单位要认真研究、抓紧落实本次验收会提出的意见和建议，确保项目顺利运行，为加快建设现代大型综合能源服务集团作出新的更大贡献。</p><p><br></p><p>韩家章指出，此次通过竣工验收，标志着项目建设圆满收官，进入正常运行管理、全面发挥效益的新阶段，作为淮南本土主力矿井，潘三矿建设安全改建及二水平延深工程，能够解决矿井安全、提升运输能力、采场接替三大问题，促进矿井安全稳产，对保障矿井安全高效开采和可持续发展具有重要意义，向淮河能源控股集团第一次党代会献上了一份厚礼。下一步，对相关工程的竣工验收，要严格按相关管理办法组织验收，细化资料准备，确保验收依法依规、合法有效。</p><p><br></p><p>胡少银代表煤业公司对验收委员会及各位专家来潘三矿开展安全改建及二水平延深工程项目竣工验收表示感谢。他指出，潘三矿安全改建及二水平延深工程建设历时近十年，在相关领导的大力支持和关心下，完成了集团公司制定的年底前完成项目竣工验收的目标。对于专家组指出的问题，要严格按要求落实整改，举一反三，全面提升煤业公司在工程建设领域的管理水平。</p><p><br></p><p>会上，省能源局煤炭处相关负责人发言，专家组组长宣读竣工验收专家组意见，集团公司资深专家宣读竣工验收结论。集团公司资深专家，集团公司、煤业公司部分机关部门、服务支持机构，矿副总以上领导参加验收会议。（于晨晨 陈恩文）</p>', //文章内容
//     "tuij": 0, //是否推荐 0不推荐 1推荐
//     "addtime": 1607690231, //新闻添加时间
//     "view_num": 3865, //观看次数
//     "materia": null, //视频链接 数据格式：Object
//     "newsImgText": 1000, //阅读图文有效时间：1000字60秒
//     "newsVideo": 20, //视频有效观看时间 单位：秒
//     "collect": false, //是否收藏
//   }
// ];
